#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/kubernetes-ops-staging-10-vpc/runs/run-1aUzmXrKYVucNoWE

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c098dac6f579d4b0]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f123e331fb3c8115]
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-097800a434f30e45a]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0c9be23a5931cf294]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06328a7b84ef55f38]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-06f8be94f1c44ade2]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-063b2b878aba11564]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-069835afa658c927e]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0fc573779d8333634]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ba49e0d9b025cdb4]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0225a5c1f1bbd0398]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a60ba528563f06cb]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08f49bacf42ea6217]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c8e88db02c29e1f2]
module.vpc.module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-05f3a437ea146bc35]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a47ec6578cc0a02e]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-085697243864effc5]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06e8057b4f8e433fa]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08c67d0f1a3946684]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cf9f99235b96c3cf]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b499cac1fbabffce]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a97dcb3594985f7d]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-07fc19912c0fabdeb]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-090848b4c34deb6aa]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0352c383f46568586]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06328a7b84ef55f381080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-063b2b878aba115641080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-06f8be94f1c44ade21080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-069835afa658c927e1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for dev"
      + id          = (known after apply)
      + name        = "dev"
      + subnet_ids  = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = "rtb-063b2b878aba11564"
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = "rtb-06f8be94f1c44ade2"
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = "rtb-069835afa658c927e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "100.64.0.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-elasticache-us-east-1a"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-elasticache-us-east-1a"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = "vpc-0c098dac6f579d4b0"
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "100.64.16.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-elasticache-us-east-1b"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-elasticache-us-east-1b"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = "vpc-0c098dac6f579d4b0"
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "100.64.32.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-elasticache-us-east-1c"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-elasticache-us-east-1c"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = "vpc-0c098dac6f579d4b0"
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0fc573779d8333634"
      ~ tags                            = {
          + "kubernetes.io/cluster/dev"       = "shared"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/dev"       = "shared"
            # (7 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0225a5c1f1bbd0398"
      ~ tags                            = {
          + "kubernetes.io/cluster/dev"       = "shared"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/dev"       = "shared"
            # (7 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0ba49e0d9b025cdb4"
      ~ tags                            = {
          + "kubernetes.io/cluster/dev"       = "shared"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/dev"       = "shared"
            # (7 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
      ~ enable_dns_hostnames             = false -> true
        id                               = "vpc-0c098dac6f579d4b0"
        tags                             = {
            "Name"                 = "dev"
            "ops_env"              = "dev"
            "ops_managed_by"       = "terraform"
            "ops_owners"           = "devops"
            "ops_source_repo"      = "kubernetes-ops"
            "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "100.64.0.0/16"
      + id         = (known after apply)
      + vpc_id     = "vpc-0c098dac6f579d4b0"
    }

Plan: 8 to add, 4 to change, 0 to destroy.


```

</details>
*Pusher: @sekka1, Action: `pull_request`*